CSI API ETABS v1
cPropMaterial.GetWeightAndMass Method
 Retrieves the weight per unit volume and mass per unit volume of the material.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetWeightAndMass(
	string Name,
	ref double W,
	ref double M,
	double Temp = 0
)
Function GetWeightAndMass (
	Name As String,
	ByRef W As Double,
	ByRef M As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim W As Double
Dim M As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetWeightAndMass(Name,
	W, M, Temp)
int GetWeightAndMass(
	String^ Name,
	double% W,
	double% M,
	double Temp = 0
)
abstract GetWeightAndMass :
        Name : string *
        W : float byref *
        M : float byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
W
Type: System.Double
The weight per unit volume for the material. [F/L3]
M
Type: System.Double
The mass per unit volume for the material. [M/L3]
Temp (Optional)
Type: System.Double
the temperature at which the specified data is to be retrieved.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim w As Double
       Dim m As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign material property weight per unit volume
       ret = SapModel.PropMaterial.SetWeightAndMass("Steel", 1, 0.00029)
   'get material weight and mass per unit volume
       ret = SapModel.PropMaterial.GetWeightAndMass("Steel", w, m)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace